app/controllers/users_controller.rb

INSERT INTO "users" ("activation_digest", "created_at", "email", "name", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
		@user = User.new(user_params)
		if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["password_digest", "$2a$10$uSBBWOk/Q7B5e.WHV1NutOaGDPY4qRUXwXncZ4DSXlp/ZhmQP61GG"], ["updated_at", "2015-01-10 22:52:53.195941"]]
---
	def update
		@user = User.find(params[:id])
		if @user.update_attributes(user_params)